[
    {
        "id": "blue-owl",
        "company": "Blue Owl Capital",
        "type": "Full-time",
        "image": "/assets/images/blueowl.png",
        "roles": [
            {
                "title": "Principal - Financial Applications",
                "dates": "Jan 2024 - Present",
                "duration": "2 yrs 1 mo",
                "description": "Visionary financial technology leader with a proven record of transforming and scaling enterprise financial systems, teams, and processes to support hypergrowth in public companies. As Head of Financial Applications, led the evolution from a single ERP platform to a multi-application landscape with over a dozen systems and ~50 integrations. Built foundational structures for support, team management, and process governance—where none existed—driving cross-functional alignment across onshore and offshore teams. Enabled company growth from $45B to $300B in AUM through innovation, compliance execution, and systems leadership aligned with strategic finance goals.",
                "achievements": [
                    "Enterprise Application Expansion: Scaled the financial applications environment from a single ERP system to a portfolio of over a dozen platforms supporting finance, legal, and operations.",
                    "Integration Ecosystem Growth: Built ~50 business-critical integrations from the ground up, enabling seamless data flow across departments and systems.",
                    "Organizational Structure & Process Design: Established foundational structures for support ticketing, team operations, and KPI tracking across onshore and offshore teams where none previously existed.",
                    "IPO Readiness & SOX Compliance: Delivered audit-ready, SOX-compliant reporting within one year of IPO by designing secure, controlled, and transparent financial system processes.",
                    "EPM Implementation Leadership: Led successful deployments of Oracle EPM modules including EDM, FCCS, and ARCS, supporting financial close, reconciliation, and planning activities.",
                    "Team Building & Leadership: Scaled the financial applications function from a solo role to a team of 15 high-performing professionals, each with ownership of key platforms.",
                    "Change Management Governance: Created and now lead a structured change management process and weekly Change Advisory Board, reducing risk and improving audit posture.",
                    "SDLC & Release Management: Instituted a finance-specific SDLC model, improving delivery discipline, quality, and traceability.",
                    "Monday.com Enterprise Adoption: Spearheaded enterprise-wide rollout of Monday.com for project management, task tracking, and change control.",
                    "Vendor Management & Contracts: Serve as the primary point of contact for all financial application vendor relationships, overseeing agreements, renewals, and strategic alignment.",
                    "C-Suite & Executive Partnership: Trusted advisor to executive leadership, including the Chief Accounting Officer, providing roadmap updates, risk overviews, and performance transparency."
                ]
            },
            {
                "title": "Vice President - Financial Applications Manager",
                "dates": "Jul 2021 - Dec 2023",
                "duration": "2 yrs 6 mos",
                "description": "Visionary financial technology leader with a proven record of transforming and scaling enterprise financial systems, teams, and processes to support hypergrowth in public companies. As Head of Financial Applications, led the evolution from a single ERP platform to a multi-application landscape with over a dozen systems and ~50 integrations. Built foundational structures for support, team management, and process governance—where none existed—driving cross-functional alignment across onshore and offshore teams. Enabled company growth from $45B to $300B in AUM through innovation, compliance execution, and systems leadership aligned with strategic finance goals.",
                "achievements": [
                    "Enterprise Application Expansion: Scaled the financial applications environment from a single ERP system to a portfolio of over a dozen platforms supporting finance, legal, and operations.",
                    "Integration Ecosystem Growth: Built ~50 business-critical integrations from the ground up, enabling seamless data flow across departments and systems.",
                    "Organizational Structure & Process Design: Established foundational structures for support ticketing, team operations, and KPI tracking across onshore and offshore teams where none previously existed.",
                    "IPO Readiness & SOX Compliance: Delivered audit-ready, SOX-compliant reporting within one year of IPO by designing secure, controlled, and transparent financial system processes.",
                    "EPM Implementation Leadership: Led successful deployments of Oracle EPM modules including EDM, FCCS, and ARCS, supporting financial close, reconciliation, and planning activities.",
                    "Team Building & Leadership: Scaled the financial applications function from a solo role to a team of 15 high-performing professionals, each with ownership of key platforms.",
                    "Change Management Governance: Created and now lead a structured change management process and weekly Change Advisory Board, reducing risk and improving audit posture.",
                    "SDLC & Release Management: Instituted a finance-specific SDLC model, improving delivery discipline, quality, and traceability.",
                    "Monday.com Enterprise Adoption: Spearheaded enterprise-wide rollout of Monday.com for project management, task tracking, and change control.",
                    "Vendor Management & Contracts: Serve as the primary point of contact for all financial application vendor relationships, overseeing agreements, renewals, and strategic alignment.",
                    "C-Suite & Executive Partnership: Trusted advisor to executive leadership, including the Chief Accounting Officer, providing roadmap updates, risk overviews, and performance transparency."
                ]
            }
        ]
    },
    {
        "id": "hcsc",
        "company": "Blue Cross and Blue Shield",
        "type": "Full-time",
        "image": "/assets/images/bcbs-logo.png",
        "roles": [
            {
                "title": "Principal Consultant - Cloud Financial Systems",
                "dates": "Mar 2019 - Jul 2021",
                "duration": "2 yrs 5 mos",
                "description": "Served as a finance thought partner in the Finance Systems Innovation organization at the largest customer-owned health insurer in the US, operating Blue Cross and Blue Shield® Plans across five states. Led functional support and transformation of Oracle Cloud financial applications (General Ledger, Allocations, Accounts Payable, Project Costing, Asset Management, Procurement). Acted as the primary liaison between business and technical teams, driving continuous improvement, operational efficiency, and best practices. Consulted on and led new projects involving strategy, implementation, and support. Administered and developed test cases for EPM (PBCS and PCMCS), Solix Data Warehouse, and Vertex Tax Engine. Provided leadership in quarterly cloud upgrade releases, process documentation, and change management.",
                "achievements": [
                    "Led Oracle ERP Cloud Quarterly upgrade releases, including impact analysis, testing, and adoption of new features.",
                    "Developed and presented KPIs to senior leadership, highlighting team performance, support metrics, and project planning.",
                    "Fostered collaborative relationships with cross-functional teams and built trust with key business stakeholders.",
                    "Supported and enhanced 30+ integrations (Mulesoft, Talend) and provided guidance in designing new interfaces.",
                    "Created and maintained documentation (configuration, test scripts, functional specs for reporting and integration).",
                    "Provided assistance in key system processes (month-end, quarter-end, year-end close).",
                    "Assisted with functional testing of monthly, quarterly, and emergency patches.",
                    "Mentored colleagues and assisted in training support for new system features.",
                    "Championed continuous process improvement and provided insights into industry best practices.",
                    "Recognized for strong analytical, troubleshooting, and change management skills."
                ]
            }
        ]
    },
    {
        "id": "infosys",
        "company": "Infosys",
        "type": "Full-time",
        "image": "/assets/images/infosys-logo.png",
        "roles": [
            {
                "title": "Financial Applications Manager (Symantec)",
                "location": "Mountain View, CA",
                "dates": "Aug 2018 - Feb 2019",
                "duration": "7 mos",
                "image": "/assets/images/logos/symantec.png",
                "description": "Designed, built, and implemented Oracle Receivables system and bridged gap between requirements and final solution. Executed new implementations, functionality improvements, and application updates in collaboration with development teams. Resolved defects and integrated new localization in partnership with Oracle Support.",
                "achievements": [
                    "Migrated multiple countries into a common ERP BlueCoat system; executed successful go-lives and UAT",
                    "Spearheaded new system functionalities and led new-user training"
                ]
            },
            {
                "title": "Lead Oracle Cloud Consultant (Titan International)",
                "location": "West Chicago, IL",
                "dates": "Dec 2017 - Jul 2018",
                "duration": "8 mos",
                "image": "/assets/images/logos/titan.png",
                "description": "Spearheaded communication efforts by elaborating key differences between client's legacy system and Oracle Cloud Financials. Performed demonstrations on Fusion Expenses and Fusion Payables functionality as key liaison between senior-level IT professionals and financial leadership team. Facilitated daily consultations with business, IT, and support teams.",
                "achievements": [
                    "Designed customized functional processes outside of Oracle Fusion Financials in collaboration with business teams",
                    "Led on-site and off-shore technical teams executing analysis, customization, and personalization of cloud system",
                    "Achieved certification as Payables Implementation Specialist for Oracle Financials Cloud"
                ]
            },
            {
                "title": "Lead Financial Functional Consultant (Johnson Controls, Inc)",
                "location": "Boca Raton, FL | Richardson, TX",
                "dates": "Oct 2017 - Dec 2017",
                "duration": "3 mos",
                "image": "/assets/images/logos/jci.png",
                "description": "Provided post-production support; analyzed system design and ERP configurations during UAT (user acceptance testing) phase of Oracle ERP upgrade and OS migration to UNIX. Designed and tested Accounts Receivable (AR) setups. Wrote test scripts; resolved defects prior to go-live.",
                "achievements": [
                    "Collaborated with first-time users and engaged with clients to assist in system assimilation and understanding",
                    "Facilitated training in partnership with business teams for GL, AR, and month-end closing processes"
                ]
            }
        ]
    },
    {
        "id": "synchrony",
        "company": "Synchrony Financial",
        "type": "Contract",
        "image": "/assets/images/synchrony-logo.png",
        "roles": [
            {
                "title": "Oracle Financial Functional Consultant",
                "dates": "Nov 2014 - Oct 2017",
                "duration": "3 yrs",
                "description": "Senior Oracle Financials Functional Analyst with experience across full life cycle implementations, upgrades, and post-production support of Oracle E-Business Suite (EBS) Financials (GL, AP, AR, FA, CE, PO, SLA, iExpense, iProcurement, Tax). Led a global team of 12, managed requirements definition, gap analysis, fit-gap analysis, system configuration, testing, user training, and support. Designed and implemented complex approval workflows using Oracle AME. Extensive experience with data migration, localization, and integration with HR and third-party systems. Facilitated business process reviews, user acceptance testing (UAT), Conference Room Pilot (CRP), and documentation for global rollouts across US, Canada, Europe, Asia, and the Philippines. Applied Oracle AIM methodology (RD20, BP80, BR30, BR100, MD50, CV40, TE40) and collaborated with all levels of business owners, users, and technical teams.",
                "achievements": [
                    "Led multi-phase implementation and upgrade: GL and FA from 11.5.10 to 12.2.3; P2P from R12.1.3 to 12.2.3; enhancements and post-production support",
                    "Facilitated translation of business requirements into detailed functional requirements and best practice solutions, including fit-gap analysis and process review",
                    "Designed and implemented approval workflows for purchase requisitions, AP invoices, supplier registration, and GL journals using Oracle AME; customized AME attributes, conditions, and rules",
                    "Managed requirements gathering, gap analysis, and documentation (BR30, MD50, BR100, RD20, BP80, CV40, TE40) for global rollouts",
                    "Created and maintained user manuals, held training sessions for large user groups, and led UAT and CRP testing phases",
                    "Implemented FA and GL localizations for India and Philippines, including tax and asset controls, block of assets, and fiscal year calendars",
                    "Developed SQL extracts, ad-hoc queries, and WebADI templates for data migration, mass upload, and reporting (using Toad/SQL Developer)",
                    "Acted as liaison between business and IT, coordinated with vendors and offshore teams for timely deliverables and aggressive timelines",
                    "Created budgets for various projects and aligned resources based on technical and functional needs",
                    "Delivered solution to successfully integrate HR data between Workday and Oracle",
                    "Conducted and evaluated process review and gap analysis to resolve requirements not addressed by Oracle apps, designing custom solutions within Oracle and with 3rd party applications",
                    "Interacted with Oracle support using Metalink and Oracle Web Conference (OWC) to resolve application issues and bugs; maintained follow-up with Oracle Service Request (SR)",
                    "Recognized for excellent verbal communication, presentation skills, and cross-functional collaboration"
                ]
            }
        ]
    },
    {
        "id": "cgg",
        "company": "CGG",
        "type": "Full-time",
        "image": "/assets/images/cgg.png",
        "roles": [
            {
                "title": "Oracle Financial Functional Support Analyst",
                "dates": "Nov 2012 - Oct 2014",
                "duration": "2 yrs",
                "description": "Financials Functional Support Analyst for Oracle EBS (AP, GL, EB-Tax, P2P) supporting global post-production operations and enhancements. Facilitated translation of business requirements into functional solutions, developed ad-hoc queries and reports, and provided training and support to finance end users. Led process improvements, system configuration, and integration with upstream/downstream applications. Conducted UAT, test planning, and documentation for enhancements, bug fixes, and upgrades. Collaborated with technical teams to develop BI reports and WebADI templates, and implemented approval rules using Oracle AME. Applied Oracle AIM methodology and participated in all phases of Conference Room Pilot (CRP1, CRP2, CRP3). Extensive use of SQL, PL/SQL, Toad, and Oracle tools for troubleshooting and reporting.",
                "achievements": [
                    "Developed and executed test plans for functional changes, bug fixes, enhancements, patches, and upgrades, including UAT and CRP phases",
                    "Configured, modified, and developed accounting rules, application configurations, and integrations within Oracle Financial modules (GL, AP, EB-Tax, P2P)",
                    "Analyzed data and integration points for upstream/downstream applications, ensuring data integrity and process efficiency",
                    "Provided solution direction for Procure to Pay (P2P) processes on a global Oracle footprint, including process mapping and risk/control identification",
                    "Defined and improved approval rules using Oracle AME to enhance PO to AP alerts and workflow automation",
                    "Wrote and optimized SQL/PLSQL queries across GL, XLA (SLA), ZX (Tax), FA, and AP tables for troubleshooting, reporting, and data migration",
                    "Drastically reduced GL and AP open issues through root cause analysis, process improvements, and proactive support",
                    "Developed and conducted UAT sessions, collaborated on BI/WebADI reporting solutions, and created user manuals and training materials",
                    "Participated in all phases of Conference Room Pilot (CRP1, CRP2, CRP3) and Oracle AIM documentation (RD20, BP80, BR30, BR100, MD50, CV40, TE40)",
                    "Recognized for strong analytical, troubleshooting, and cross-functional collaboration skills"
                ]
            }
        ]
    }
]