[

  {
    "id": "proj_property",
    "title": "Property Management Dashboard (Under Development)",
    "brief": "A modern dashboard for managing rental properties, tenants, and finances. Currently in development.",
    "details": "<strong>Status:</strong> Under active development.<br><br><strong>Purpose:</strong> Streamline property management tasks including lease tracking, rent collection, maintenance requests, and financial reporting.<br><br><strong>Planned Features:</strong> Multi-property support, tenant portal, automated reminders, analytics dashboard, secure document storage, and mobile-friendly design.<br><br><strong>Tech Stack:</strong> React, Node.js, MongoDB, REST API, authentication, cloud deployment.<br><br><strong>Why:</strong> To simplify and automate the day-to-day operations for property owners and managers, improving efficiency and transparency."
  },
  {
    "id": "proj0",
    "title": "Personal Portfolio Website (This Site)",
    "brief": "A custom-coded personal portfolio site built from scratch to showcase my work, experience, and contact info.",
    "details": "<strong>Tools Used:</strong> VS Code, Git, GitHub, Eleventy (11ty), Nunjucks, Formspree, custom CSS/JS.<br><br><strong>Architecture:</strong> Static site generated with Eleventy, modular Nunjucks templates, global JSON data for content, assets pipeline for CSS/JS/images, deployed via GitHub Pages.<br><br><strong>Content:</strong> Profile, Experience, Education, Licenses, Volunteering, Honors & Awards, Speaker Gallery, Specializations, Projects, Contact form.<br><br><strong>Features:</strong> Sticky sidebar navigation, collapsible panels, responsive design, dark theme, accessible markup, live reload dev server, automated builds.<br><br><strong>Why:</strong> I vibe-coded this site to have full control over design, content, and workflow, using modern tools and best practices for maintainability and speed."
  },
  {
    "id": "proj_blog",
    "title": "Blog: Oracle ERP/EPM SQL & Technical",
    "brief": "A curated collection of Oracle ERP/EPM SQL queries, technical notes, and solutions. Visit the blog page for the full archive.",
    "details": "<ul style='margin:0.5em 0 0.5em 1.5em;'><li>Step-by-step SQL query examples for Oracle Financials, EPM, and Cloud Apps</li><li>Technical deep-dives and troubleshooting guides</li><li>Best practices for reporting, integration, and automation</li><li>Tips for functional and technical consultants</li></ul><ul><a href='/blog/' style='display:inline-block;margin-top:1em;color:#2563eb;font-weight:600;'>See all blog posts &rarr;</a>"
  },
  {
    "id": "proj_touch",
    "title": "Capacitive Touch Panel Project",
    "brief": "A hardware and software project to design and prototype a custom capacitive touch interface.",
    "details": "<strong>Overview:</strong> Developed a multi-zone capacitive touch panel for interactive control surfaces.<br><br><strong>Tools & Technologies:</strong> Arduino, custom PCB design, capacitive sensing libraries, C/C++, 3D printing for enclosure, oscilloscope for signal analysis.<br><br><strong>Architecture:</strong> Hardware: custom PCB with multiple touch pads, microcontroller for signal processing, USB interface for PC connectivity.<br>Software: firmware for real-time touch detection, debounce logic, event mapping to user actions.<br><br><strong>Features:</strong> Multi-zone touch detection, adjustable sensitivity, plug-and-play USB interface, open-source firmware.<br><br><strong>Applications:</strong> Used for custom control panels, musical instruments, and interactive installations."
  }
]
